## Plan Result (prod-enterprise)




<pre><code>Plan: 46 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_application.app
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-ROBOTICS-DEV&#34;].time_rotating.rotation_period
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-NonProd&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["CFT-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
        name                       = "CFT-NonProd"
      ~ subscription_ids           = [
          - "1c4f0704-a29e-403d-b719-b90c34ef14c9",
          - "62864d44-5da9-4ae9-89e7-0cf33942fa09",
          - "7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c",
          - "8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c",
          - "8b6ea922-0862-443e-af15-6056e1c9b9a4",
          - "d025fece-ce99-4df2-b7a9-b649d3ff2060",
          - "dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25",
          - "ddd45636-d58a-437f-8ad8-99b0add0092b",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:dts-robotics-dev)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-robotics-dev) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dts-robotics-dev)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-robotics-dev) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dts-robotics-dev)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"

          + implicit_grant {
              + access_token_issuance_enabled = false
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS AKS Administrators (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS AKS Users (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Contributors (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Owners (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Readers (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Security Readers (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the DTS-ROBOTICS-DEV subscription"
      + display_name                   = "DTS Blob Readers (sub:dts-robotics-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Contributor-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Contributor-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_group_member.members["Reader-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azuredevops_serviceendpoint_azurerm.endpoint will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id   = (known after apply)
      + azurerm_subscription_name = "DTS-ROBOTICS-DEV"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "c8947a39-47e3-4236-8bc8-51ff42dbda51"
      + service_endpoint_name     = "DTS-ROBOTICS-DEV"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_groups["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Monitoring Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Network Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "DTS-ROBOTICS-DEV"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "DTS-ROBOTICS-DEV"
      + tenant_id         = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-ROBOTICS-DEV"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 46 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":54,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->